Tekla Open API Reference for Tekla Structures 2025
BoltArray Constructor
 Creates a new bolt array instance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BoltArray()
Public Sub New
See Also
Reference
BoltArray Class
Tekla.Structures.Model Namespace